---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.ObjectAccessException
source: html/f314a0e3-92fa-c47a-d040-2c697e883cc9.htm
---
# ObjectAccessException Methods

Retrieves data needed to serialize the target object.